app/Controllers/Film.php

SELECT *
FROM `film`
WHERE `film`.`id` = '3'
---
            return redirect()->back()->withInput()->with('errors', $errors);
        }
        //ambil data lama
        $film = $this->film->find($this->request->getPost('id'));

UPDATE `film` SET `nama_film` = 'Age Of Ultron', `id_genre` = '3', `duration` = '3 jam', `cover` = '1688404225_b072e2b851ba3e07af3b.jpg'
WHERE `film`.`id` IN ('3')
---
            //jika ada tambahkan array cover di variable $data
            $data['cover'] = $imageName;
        }
        $this->film->save($data);