app/Models/FilmModel.php

            public function getAllDataJoin()
            {
                $query = $this->db->table("film")
                ->select("film.*, genre.nama_genre")
                ->join("genre", "genre.id_genre = film.id_genre");
                return $query->get()->getResultArray();
---
SELECT `film`.*, `genre`.`nama_genre`
FROM `film`
JOIN `genre` ON `genre`.`id_genre` = `film`.`id_genre`

        public function getDataByID($id)
        {
            return $this->find($id);
---
SELECT *
FROM `film`
WHERE `film`.`id` = '3'